Request/purchasePartnerProduct_INT.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:pfws="http://pfws.webservices.symantec.com/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <pfws:purchasePartnerProduct>
         <!--Optional:-->
         <purchasePartnerProductRequest>
            <requestVendor>
               <vendorID>10004</vendorID>
                <vendorPW>(k3aD^7^JCM</vendorPW>
               <vendorSiteID>1000389</vendorSiteID>
            </requestVendor>
            <!--Optional:-->
            <version>201340</version>
            <partnerAccountDetails>
               <partnerId>1013340</partnerId>
               <!--Optional:-->
               <partnerUserId>SOS9764477TEST</partnerUserId>
            </partnerAccountDetails>
            <partnerUnitCode>AON</partnerUnitCode>
            <trackingInfo>
               <!--Optional:-->
              <siteUser/>
               <!--Optional:-->
               <storeID/>
            </trackingInfo>
            <requestInfo>
               <!--Optional:-->
               <requestID>req2388185TEST</requestID>
               <resend>0</resend>
            </requestInfo>
            <partnerOrderDetail>
               <orderID>req4285259TEST</orderID>
            </partnerOrderDetail>
            <orderItemList>
               <!--1 or more repetitions:-->
               <orderItem>
                  <!--You have a CHOICE of the next 3 items at this level-->
                  <baseOrder>
                     <orderItemNo>1</orderItemNo>
                     <skup>
                        <value>21389232</value>
                     </skup>
                     <quantity>1</quantity>
                  </baseOrder>
               </orderItem>
            </orderItemList>
         </purchasePartnerProductRequest>
      </pfws:purchasePartnerProduct>
   </soapenv:Body>
</soapenv:Envelope>